---
kind: property
id: P:Autodesk.Revit.DB.Visual.Noise.TextureRealWorldOffsetY
source: html/54d11e3d-30b2-5fc1-d9fd-9bd0ddfe2cd1.htm
---
# Autodesk.Revit.DB.Visual.Noise.TextureRealWorldOffsetY Property

The property labeled "Offset Y" from the "Noise" schema.

## Syntax (C#)
```csharp
public static string TextureRealWorldOffsetY { get; }
```

## Remarks
This property is of type "AssetPropertyDistance".